Repository: kuth-chi/loanproject
Catalog: loansystems/locale/*/LC_MESSAGES/django.po
Languages: km

source: English
km: ភាសាអង្គគ្លេស់

source: Khmer
km: ភាសាខ្មែរ

source: Prime Minister
km: នាយករដ្ឋមន្ត្រី

source: President
km: ប្រធានាធបតី

source: Countries
km: ប្រទេស

source: Customer Addresses
km: អាសយដ្ឋានអតិថិជន

source: Customer Shipping Addresses
km: អាសយដ្ឋានដឹកជូនអតិថិជន

source: Company Addresses
km: អាសយដ្ឋានក្រុមហ៊ុន

source: day
km: ថ្ងៃ

source: week
km: សប្តាហ៍

source: month
km: ខែ

source: quarter
km: ត្រីមាស

source: semester
km: ឆមាស

source: year
km: ឆ្នាំ

source: fixed flat
km: ថេរដើមថយការ

source: Equal Installments
km: សរុបថេរ

source: fixed rate
km: ការថេរ

source: on going
km: កំពុងបន្ត

source: completed
km: បានបញ្ចប់

source: lost
km: ខូច

source: active
km: សកម្ម

source: refunded
km: សងវិញ

source: expired
km: ផុតកំណត់

source: sold
km: បានលក់

source: Login
km: ចូល

source: User Login
km: ចូលទៅកាន់គណនី

source: Enter email address
km: បញ្ចូល​អីម៉ែល

source: Enter password
km: បញ្ចូលពាក្យសម្ងាត់

source: Forgot Username/Password?
km: បានភ្លេច ឈ្មោះ ឬ ពាក្យសម្ងាត់​?

source: Forgot Your Password?
km: បានភ្លេច ឈ្មោះ ឬ ពាក្យសម្ងាត់​?

source: Enter your email address below, and well email instructions for setting a new one.
km: បញ្ចូលអ៊ីមែលខាងក្រោមនេះ​ ហើយការនែរនាំតាមអ៊ីមែលដើម្បីកំណត់ថ្មីមួយផ្សេងទៀត

source: Customer Address
km: អាសយដ្ឋានអតិថិជន

source: Customer
km: អតិថិជន

source: Customer detail
km: លម្អិតអំពីអតិថិជន

source: Back
km: ត្រលប់ក្រោយ

source: Save
km: រក្សាទុក

source: Loan System
km: ប្រព័ន្ធគ្រប់គ្រងកម្ចី

source: © 2023 All right reserved.
km: រក្សាសិទ្ធិដោយ

source: v
km: វី

source: Ez Startup - Team
km: ក្រុម Ez Startup

source: Dashboard
km: ផ្ទាំងគ្រប់គ្រង

source: Customer list
km: បញ្ជីរឈ្មោះអតិថិជន

source: Payment
km: ការទូទាត់

source: Address
km: អាសយដ្ឋា​ន

source: Country
km: ប្រទេស

source: Province
km: ខេត្ត

source: District
km: ស្រុក ឬ​ ខ័ណ្ឌ

source: Commune
km: ឃុំ ឬ សង្កាត់

source: Village
km: ភូមិ

source: Collateral
km: ទ្រព្យបញ្ចាំ

source: Collateral List
km: បញ្ជីរវត្ថុបញ្ចាំ

source: Report
km: របាយការណ៍

source: Overduedate
km: កាលបរិច្ឆេទបំណុល

source: Recent Activities
km: សកម្មភាពថ្មីៗ

source: Paw
km: វត្ថុបញ្ជាំ

source: Loan
km: កម្ចី

source: Welcome
km: ស្វាគមន៍

source: Setting
km: ការកំណត់

source: Mange Company
km: គ្រប់គ្រងក្រុមហ៊ុន

source: Language
km: ភាសា

source: Logout
km: ចាកចេញ

source: Manage Address
km: គ្រប់គ្រងអាសយដ្ឋាន

source: Manage Customer
km: គ្រប់គ្រងអតិថិជន

source: commune list
km: បញ្ជីឈ្មោះឃុំ ឬ សង្កាត់

source: commune detail
km: លម្អិតអំពីឃុំ ឬ សង្កាត់

source: Delete commune
km: លុបឃុំ ឬ សង្កាត់

source: Are you sure want to delete
km: តើអ្នកពិតជាចង់លុបមែនឬទេ

source: Cancel
km: បោះបង់

source: Delete
km: លុប

source: Name
km: ឈ្មោះ

source: Name local
km: ឈ្មោះជាភាសាជាតិ

source: Short name
km: ឈ្មោះកាត់

source: Code
km: កូដ

source: Border with
km: មានព្រំប្រទល់ជាប់

source: Border Length
km: ប្រវែងព្រំប្រទល់

source: Hotline
km: ខ្សែទូរស័ព្ទទាន់ហេតុការណ៍

source: Create Commune_form
km: បង្កើតទម្រប់បំពេញទិន្ន័យឃុំ ឬ សង្កាត់

source: Commune list
km: បញ្ជីរឈ្មោះឃុំ ឬ សង្កាត់

source: Update Commune
km: ធ្វើបច្ចុប្បន្នភាពឃុំ ឬ​ សង្កាត់

source: Create commune
km: បង្កើតឃុំ ឬ សង្កាត់

source: Update Commune
km: ធ្វើបច្ចុប្បន្នភាពឃុំ ឬ សង្កាត់

source: Create Commune
km: បង្កើតឃុំ ឬ សង្កាត់

source: District Name
km: ឈ្មោះស្រុក ឬ ខ័ណ្ឌ

source: Commune Name
km: ឈ្មោះឃុំ ឬ សង្កាត់

source: Update
km: ធ្វើបច្ចុប្បន្នភាព

source: Add
km: បន្ថែម

source: Short Name
km: ឈ្មោះកាត់

source: Actions
km: វិធានការ

source: Details
km: លម្អិត

source: Are you sure want to delete
km: តើអ្នកពិតជាចង់លុបមែន ឬទេ

source: Confirm
km: បញ្ចាក់

source: Country Detail
km: លម្អិតអំពីប្រទេស

source: Country list
km: បញ្ជីរឈ្មោះប្រទេស

source: Country detail
km: លម្អិតអំពីប្រទេស

source: Delete customer
km: លុបអតិថិជន

source: DETAILS
km: ពត៌មានលម្អិត

source: Currency
km: រូបិយប័ណ្ណ

source: Primary language
km: ភាសាចម្លង

source: Alt languages
km: ភាសាដទៃ

source: Landmark
km: ផ្ទៃដី

source: Leader name
km: ឈ្មោះអ្នកដឹកនាំ

source: Leader position
km: តំណែងអ្នកដឹកនាំ

source: Is before chris
km: មុនគ្រឹស្តសករាជ

source: Country Form
km: ទម្រង់បំពេញទិន្ន័យប្រទេស

source: Update country
km: ធ្វើបច្ចុប្បន្នភាពទិន្នន័យប្រទេស

source: Create country
km: បង្កើតទិន្នន័យប្រទេស

source: Update Country
km: ធ្វើបច្ចុប្បន្នភាពទិន្នន័យប្រទេស

source: Create Country
km: បង្កើតទិន្នន័យប្រទេស

source: Country Name
km: ឈ្មោះប្រទេស

source: Local Name
km: ឈ្មោះប្រទេសជាភាសាជាតិ

source: Primary Language
km: ភាសាចម្បង

source: Alt Languages
km: ភាសាដទៃ

source: Border With
km: ជាប់ព្រំប្រទល់

source: Leader Name
km: ឈ្មោះថ្នាក់ដឹកនាំ

source: Leader Position
km: តំណែងថ្នាក់ដឹកនាំ

source: Born Year
km: កើតនៅឆ្នាំ

source: Is Before chris
km: មុនគ្រឹសករាជ

source: Country List
km: បញ្ជីរឈ្មោះប្រទេស

source: County Name
km: ឈ្មោះប្រទេស

source: District Detail
km: ពត៌មានលម្អិអំពីស្រុក ឬ ខ័ណ្ឌ

source: District list
km: បញ្ជឹរឈ្មោះស្រុក ឬ ខ័ណ្ឌ

source: District detail
km: លម្អិអំពីស្រុក ឬ ខ័ណ្ឌ

source: Delete district
km: លុបស្រុក ឬ ខ័ណ្ឌ

source: Distric Form
km: ទម្រង់បំពេញទិន្នន័យស្រុក​ឬ ខ័ណ្ឌ

source: Update District
km: ធ្វើបច្ចុប្បន្នភាពស្រុក ឬ ខ័ណ្ឌ

source: Create District
km: បង្កើតទិន្នន័យស្រុក ឬ ខ័ណ្ឌ

source: Province Name
km: ឈ្មោះខេត្ត

source: Distric list
km: បញ្ជីឈ្មោះស្រុក ឬ ខ័ណ្ឌ

source: Province Detail
km: លម្អិតអំពីខេត្ត

source: Province list
km: បញ្ជីឈ្មោះខេត្ត

source: Province detail
km: លម្អិតអំពីខេត្ត

source: Delete Province
km: បង្កើតទិន្នន័យខេត្ត

source: Province Detail
km: លម្អិតអំពីខេ្ត

source: Leander
km: អ្នកដឹកនាំ

source: Province Form
km: ទម្រង់បំពេញទិន្ន័យខេត្ត

source: Update province
km: ធ្វើបច្ចុប្បន្នភាពខេត្ត

source: Create province
km: បង្កើតខេត្ត

source: Update province
km: ធ្វើបច្ចុប្បន្នភាពខេត្ត

source: Create Province
km: បង្កើតទិន្នន័យខេត្ត

source: Leader
km: អ្នកដឹកនាំ

source: Village Detail
km: លម្អិតអំពីភូមិ

source: Village list
km: បញ្ជីរឈ្មោះរូប

source: Village detail
km: លម្អិតអំពីភូមិ

source: Delete village
km: លុបទិន្នន័យភូមិ

source: Village Detail
km: លម្អិតអំពីភូមិ

source: Village Form
km: ទម្រង់បំពេញទិន្នន័យភូមិ

source: Update Village
km: ធ្វើបច្ចុប្បន្នភាពអំពីភូមិ

source: Create Village
km: បង្កើតភូមិ

source: Create Village
km: បង្កើតភូមិ

source: Village Name
km: ឈ្មោះភូមិ

source: Village List
km: បញ្ជីរឈ្មោះភូមិ

source: A village is a small settlement usually found
km: ភូមិគឺជាការតាំងទីលំនៅតូចមួយដូចដែលយើងបានឃើញ

source: Detail
km: លម្អិត

source: Update Collateral
km: បង្កើតពត៌មានទ្រព្យបញ្ចាំ

source: Create New Collateral
km: បង្កើតពត៌មានទ្រព្យបញ្ចាំ

source: Status
km: ស្ថានភាព

source: Description
km: ពណ៌នា

source: Price
km: តម្លៃ

source: Condition
km: លក្ខខណ្ឌ

source: Date
km: កាលបរិច្ឆេទ

source: Expiration date
km: កាលបរិច្ឆេទនៃកាលផុតកំណត់

source: Attached Images
km: រូបភាពដែលបានភ្ជាប់ជាមួយ

source: Submit
km: បញ្ជូន

source: Collateral Detail
km: ពត៌មានអំពីទ្រព្យបញ្ចាំ

source: Delete customer
km: លុបអតិថិជន

source: Collateral Of
km: បញ្ចូលឈ្មោះ

source: Belonging of
km: ជាកម្មសិទ្ធ

source: Type
km: ប្រភេទ

source: Worths
km: មានតម្លៃ

source: Search collateral
km: ស្វែងរកវត្ថុបញ្ចាំ

source: Expired
km: ផុតកំណត់

source: Update customer address
km: ធ្វើបច្ចុប្បន្នភាពអាសយដ្ឋានអតិថិជន

source: Create customer address
km: បង្កើតអាសយដ្ឋានអតិថិជន

source: Delete customer address
km: លុបអាសយដ្ឋានអតិថិជន

source: Customer Detail
km: អំពីអតិថិជន

source: Fullpaid
km: បានទូទាត់រួច

source: Overview
km: ទិដ្ឋភាពទូទៅ

source: Personal
km: ផ្ទាល់ខ្លួន

source: Overdue
km: ដល់កំណត់

source: No data
km: គ្មានទិន្នន័យកម្ចី

source: This Year
km: ឆ្នាំនេះ

source: Update information
km: កែរប្រែព័ត៌មាន

source: Latin
km: ឈ្មោះអក្សរឡាតាំង

source: Phone
km: ទូរស័ព្ទ

source: Relationship status
km: ស្ថានភាពសម្ព័នភាព

source: Married
km: រៀបការហើយ

source: Single
km: នៅលីវ

source: Email
km: អ៊ីម៉ែល

source: Gender
km: ភេទ

source: Male
km: ប្រុស

source: Female
km: ស្រី

source: Birthday
km: ថ្ងៃកំណើត

source: Name spouse
km: ឈ្មោះប្តី ឬ ប្រពន្ធ

source: ADDRESS
km: អាសយដ្ឋាន

source: Street
km: ផ្លូវ

source: Location
km: ទីតាំង

source: Add address
km: បន្ថែមអាសយដ្ឋាន

source: IDENTIFY
km: សំគាល់

source: Card type
km: ប្រភេទកាត

source: Expiration
km: កាលបរិច្ឆេទនៃកាលផុតកំណត់

source: Verify information
km: បញ្ជាក់ព័ត៌មាន

source: Verify now
km: ផ្ទៀងផ្ទាត់​ឥឡូវ​នេះ

source: Create loan
km: បង្កើតកម្ចី

source: Amount
km: ទឹកប្រាក់

source: Cycle
km: ជុំ

source: Rate
km: អត្រា

source: Paid
km: បានទូទាត់

source: unread messages
km: សារមិនទាន់អាន

source: Completed
km: បានបញ្ចប់

source: On going
km: កំពុងបន្ត

source: No loan data
km: គ្មានទិន្នន័យយកម្ចី

source: Payment ref
km: យោងការទូទាត់

source: Loan ID
km: លេខសម្គាល់កម្ចី

source: Interest
km: ការប្រាក់

source: Principle
km: ប្រាក់ដើម

source: Due date
km: កាលបរិច្ឆេទបំណុល

source: Image
km: រូបភាព

source: Title
km: ចំណងជើង

source: Staus
km: ស្ថានភាព

source: Expired date
km: កាលបរិច្ឆេទនៃការទូទាត់

source: Add paw
km: បន្ថែមបញ្ជាំ

source: Update customer information
km: ធ្វើបច្ចុប្បន្នភាពអាសយដ្ឋានអតិថិជន

source: Create new customer information
km: បង្កើតពត៌មានអតិថិជន

source: Name khmer
km: ឈ្មោះជាភាសាខ្មែរ

source: Enter name
km: បញ្ចូលឈ្មោះ

source: Name english
km: ឈ្មោះជាភាសាអង្គគ្លេស់

source: Enter name english
km: បញ្ចូលឈ្មោះជាភាសាអង្គគ្លេស់

source: Other
km: ផ្សេង

source: Add name spouse
km: បន្ថែមឈ្មោះប្តី ឬ ប្រពន្ធ

source: Id for
km: អត្តសញ្ញាណសម្រាប់

source: Create Indentify Id for
km: បង្កើតលេខសម្គាល់អត្តសញ្ញាណសម្រាប់

source: Number
km: លេខ

source: number
km: លេខ

source: Identity
km: អត្តសញ្ញាណ

source: Passport
km: លិខិតឆ្លងដែន

source: Drivers license
km: ប័ណ្ណបើកបរ

source: Expire date
km: ផុតកាលបរិច្ឆេទ

source: Customer List
km: បញ្ជីរឈ្មោះអតិថិជន

source: search loan
km: ស្វែងរកកម្ចី

source: Update New Loan
km: បង្កើតកម្ចីថ្មី

source: Create New Loan
km: បង្កើតកម្ចីថ្មី

source: Loan amount
km: ទឹកប្រាក់កម្ចី

source: Payment method
km: វិធីទូទាត់

source: Loan term
km: រយះពេលកម្ចី

source: Interest rate
km: ការប្រាក់

source: Rate calculate method
km: វិធីគណនាអត្រាការប្រាក់

source: Loan date
km: កាលបរិច្ឆេទកម្ចី

source: Pay off
km: បង់ផ្តាច់

source: Set first payment date
km: កំណត់កាលបរិច្ឆេទទូទាត់ដំបូង

source: update
km: ធ្វើបច្ចុប្បន្នភាព

source: Loan detail
km: អំពីកម្ចី

source: Loan list
km: បញ្ចីរកម្ចី

source: Customers detail
km: លម្អិតអំពីអតិថិជន

source: Edit
km: កែប្រែ

source: Loan number
km: លេខសម្គាល់កម្ចី

source: Download
km: ទាញយក

source: Print
km: បោះពុម្ព

source: Save PDF
km: រក្សាទុកជា​ឯកសារ PDF

source: Create collateral
km: បង្កើតពត៌មានទ្រព្យបញ្ចាំ

source: Balance
km: សមតុល្យ

source: Returned
km: សងវិញ

source: Payment date
km: ថ្ងៃបង់ប្រាក់

source: Numer of day
km: ចំនួនថ្ងៃ

source: To be paid
km: ត្រូវទូទាត់

source: Outstanding
km: បំណុល

source: Action
km: វិធានការ

source: Pay
km: ទូទាត់

source: Loan payback
km: ទូទាត់សង

source: Pay date
km: ថ្ងៃបង់ប្រាក់

source: Jan
km: មករា

source: Feb
km: កុម្ភៈ

source: Mar
km: មីនា

source: Apr
km: ​មេសា

source: May
km: ​ឧសភា

source: Jun
km: មិថុនា

source: Jul
km: កក្កដា

source: Aug
km: សីហា

source: Sep
km: កញ្ញា

source: Oct
km: តុលា

source: Nov
km: វិច្ឆិកា

source: Dec
km: ធ្នូ

source: `Interest`
km: `ការប្រាក់`

source: `Principle`
km: `ប្រាក់ដើម`

source: `Paid`
km: `បានទូទាត់`

source: Invest volume
km: ទំហំវិនិយោគ

source: last
km: ចុងក្រោយ

source: No Data
km: ពុំមានទិន្នន័យ

source: current
km: បច្ចុប្បន្ន

source: Principle return
km: ប្រាក់ដើមមកវិញ

source: Earned
km: ចំណូល

source: Loanee
km: កូនបំណុល

source: This month
km: ខែនេះ

source: Loan Transaction
km: ប្រតិបត្តការណ៍សង

source: Paw Transaction
km: ប្រតិបត្តការណ៍សង

source: Analytics
km: ការវិភាគទិន្នន័យ

source: Last month
km: ខែមុន

source: This year
km: ឆ្នាំ

source: Last year
km: ឆ្នាំមុន

source: days
km: ថ្ងៃ

source: More
km: ច្រើនទៀត

source: Payback
km: ទូទាត់សង

source: Create
km: បង្កើតបញ្ជាំថ្មី

source: Admin do something
km: អ្នកគ្រប់គ្រងធ្វើរឿងខ្លះ

source: New customer
km: អតិថិជនថ្មី

source: New customer from
km: អតិថិជនថ្មី

source: New loan
km: បន្ថែមកម្ចីថ្មី

source: Update loan from
km: កែរប្រែកម្ចីពី

source: Delete loan
km: លុបកម្ចី

source: New
km: ថ្មី

source: from
km: ពី

source: By
km: ដោយ

source: No Data
km: ពុំមានទិន្នន័យ

source: Add customer successfully !
km: បន្ថែមអតិថិជនដោយជោគជ័យ

source: Cancel create customer !
km: បោះបង់ការបង្កើតអតិថិជន

source: FULL PAID
km: ទូទាត់ពេញ

source: Pay Amount
km: ទឹកប្រាក់ទូទាត់

source: Loan Detail
km: អំពីកម្ចី

source: Customer Name
km: ឈ្មោះអតិថិជន

source: Period
km: អំឡុងពេល

source: Day
km: ថ្ងៃ

source: Week
km: សប្តាហ៍

source: Month
km: ខែ

source: Quarter
km: ត្រីមាស

source: Semester
km: ឆមាស

source: Year
km: ឆ្នាំ

source: Customer ID
km: លេខសម្គាល់អតិថិជន

source: Loan type
km: ប្រភេទកម្ចី

source: Fixed flat
km: បង់ដើមថេរ

source: Fixed rate
km: អត្រាថេរ

source: First pay date
km: ថ្ងៃទូទាត់ដំបូង

source: N/A
km: ពុំមាន

source: Add addresss
km: បន្ថែមអាសយដ្ឋាន

source: Schedule
km: កាលវិភាគ

source: Alerts
km: ការជូនដំណឹង

source: Full paid
km: បានទូទាត់រួច

source: Total
km: សរុប

source: Payment Amount
km: ទឹកប្រាក់ទូទាត់

source: Full Paid
km: បានទូទាត់រួច

source: No payback transaction yet.
km: ពុំមានប្រតិបត្តការណ៍សង

source: List of collateral
km: បញ្ចីទ្រព្យបញ្ចាំ

source: Add collateral
km: បន្ថែមព្រទ្យ

source: Attechment file
km: ឯកសារភ្ជាប់

source: Completed loan
km: បានបញ្ចប់

source: Loan List
km: បញ្ចីរកម្ចី

source: Previous
km: ថយក្រោយ

source: Next
km: បន្ទាប់

source: Preview Print
km: មើលបោះពុម្ព

source: Paw compnay name
km: ឈ្មោះក្រុមហ៊ុនបញ្ចាំ

source: Microfinance short PN
km: មីក្រូហិរញ្ញវត្ថុ

source: BANK INFOMATION
km: ព័ត៌មានធនាគារ

source: Schedule Payment
km: តាងរាងបង់ប្រាក់

source: Customer name
km: ឈ្មោះអតិថិជន

source: Customer number
km: លេខសម្គាល់អតិថិជន

source: Identity card number
km: លេខអត្តសញ្ញាណប័ណ្ណ

source: First pay loan
km: ថ្ងៃទូទាត់ដំបូង

source: Loan method
km: ប្រភេទកម្ចី

source: Priciple
km: ប្រាក់ដើម

source: Total amount
km: សរុបទឹកប្រាក់

source: Note
km: ចំណាំ

source: In case late payment base on dude date loanee agree to pay additional amount by following the penalty <a href="/" class="text-decoration-none" >policy</a>.
km: ក្នុង​ករណី​ដែល​មូលដ្ឋាន​នៃ​ការ​ទូទាត់​យឺត​តាម​កាល​បរិច្ឆេទ​កំណត់ អ្នក​ខ្ចី​យល់ព្រម​បង់​ប្រាក់​បន្ថែម​ដោយ​អនុវត្ត​តាម​ការ​ពិន័យ <a href="/" class="text-decoration-none" >policy</a>។

source: Company Behavior
km: តំណាងក្រុមហ៊ុន

source: Loanee Signature
km: កូនបំណុល

source: Paw Detail
km: ពត៌មានបញ្ចាំ

source: Attachement
km: រូបភាពដែលបានភ្ជាប់ជាមួយ

source: Refund
km: សងវិញ

source: Information
km: ព័ត៌មាន

source: Owner
km: ច្ចាស់

source: Conditions
km: លក្ខខណ្ឌ

source: Payment as
km: ការទូទាត់ជា

source: Value
km: តម្លៃ

source: Paid Date
km: ថ្ងៃបង់ប្រាក់

source: Update Paw
km: ធ្វើបច្ចុប្បន្នភាព

source: Create Paw
km: បង្កើតបញ្ជាំថ្មី

source: Pay cycle
km: វដ្តបង់ប្រាក់

source: Price offer
km: តម្លៃ

source: Percentage
km: ភាគរយ

source: Paw List
km: បញ្ចីរបញ្ចាំ

source: PAYBACK DETAIL
km: ព័ត៌មានលម្អិតអំពីការសងប្រាក់

source: Total Amount
km: សរុបទឹកប្រាក់

source: search customer
km: ស្វែងរកអតិថិជន

source: Loan progress
km: ដំណើរការកម្ចី

source: Total Interest
km: ការប្រាក់សរុប

source: Total Principle
km: ប្រាក់ដើមសរុប

source: Total Balance
km: សមតុល្យ

source: Payback list
km: បញ្ចីរទូទាត់សង

source: Payback detail
km: អំពីការសង

source: Create Loan
km: បង្កើតកម្ចី

source: Payment list
km: បញ្ជីរការទូទាត់

source: Delete Activities activities
km: លុបសកម្មភាពថ្មីៗ

source: Clean All Activities
km: សម្អាតសកម្មភាពថ្មីៗ

source: Are you sure want to Clean all Data Activities
km: តើអ្នកពិតជាចង់លុបមែនឬទេ

source: {editor}: Editing failed
km: {editor}៖ ការកែសម្រួលបានបរាជ័យ

source: {editor}: Editing failed: {e}
km: {editor}៖ ការកែសម្រួលបានបរាជ័យ៖ {e}

source: Aborted!
km: រំលូតចោល

source: Show this message and exit.
km: បង្ហាញសារនេះហើយចេញ។

source: (Deprecated) {text}
km: (បានបដិសេធ) {text}

source: Options
km: ជម្រើស

source: Got unexpected extra argument ({args})
km: ទទួលបានអាគុយម៉ង់បន្ថែមដែលមិនរំពឹងទុក ({args}

source: DeprecationWarning: The command {name!r} is deprecated.
km: ប្រមានពីការផ្អាក: បញ្ជា {name!r} ត្រូវបានផ្អាក

source: Commands
km: ពាក្យបញ្ជា

source: Missing command.
km: ខ្វះបញ្ជា

source: No such command {name!r}.
km: ពុំមានពាក្យបញ្ជា {name!r}

source: Value must be an iterable.
km: តម្លៃត្រូវតែអាចយល់បាន

source: Takes {nargs} values but 1 was given.
km: យកតម្លៃ {nargs} ប៉ុន្តែ 1 ត្រូវបានផ្តល់ឱ្យ។

source: (dynamic)
km: (ថាមវន្ត)

source: default: {default}
km: លំនាំដើម៖ {default}

source: required
km: តម្រូវការ

source: %(prog)s, version %(version)s
km: %(prog)s, កំណែ %(កំណែ)s

source: Show the version and exit.
km: បង្ហាញកំណែហើយចេញ។

source: Error: {message}
km: កំហុស៖ {mesage}

source: Try '{command} {option}' for help.
km: សាកល្បង '{command} {option}' សម្រាប់ជំនួយ។

source: Invalid value: {message}
km: តម្លៃ​មិន​ត្រឹមត្រូវ៖ {mesage}

source: Invalid value for {param_hint}: {message}
km: តម្លៃមិនត្រឹមត្រូវសម្រាប់ {param_hint}៖ {message}

source: Missing argument
km: បាត់អាគុយម៉ង់

source: Missing option
km: បាត់ជម្រើស

source: Missing parameter
km: បាត់ប៉ារ៉ាម៉ែត្រ

source: Missing {param_type}
km: បាត់ {param_type}

source: Missing parameter: {param_name}
km: បាត់ប៉ារ៉ាម៉ែត្រ៖ {param_name}

source: No such option: {name}
km: មិនមានជម្រើសបែបនេះទេ៖ {name}

source: Did you mean {possibility}?
km: តើអ្នកមានន័យថា {possibility}?

source: unknown error
km: កំហុសមិនស្គាល់

source: Could not open file {filename!r}: {message}
km: មិនអាចបើកឯកសារ {filename!r}៖ {message}

source: Argument {name!r} takes {nargs} values.
km: អាគុយម៉ង់ {name!r} យកតម្លៃ {nargs} ។

source: Option {name!r} does not take a value.
km: ជម្រើស {name!r} មិនយកតម្លៃទេ។

source: Option {name!r} requires an argument.
km: ជម្រើស {name!r} ទាមទារ​អាគុយម៉ង់

source: Shell completion is not supported for Bash versions older than 4.4.
km: ការបំពេញសែលមិនត្រូវបានគាំទ្រសម្រាប់កំណែ Bash ចាស់ជាង 4.4 ទេ។

source: Couldn't detect Bash version, shell completion is not supported.
km: មិនអាចរកឃើញកំណែ Bash ទេ ការបំពេញសែលមិនត្រូវបានគាំទ្រទេ។

source: Repeat for confirmation
km: បញ្ជាក់សារឡើងវិញ

source: Error: The value you entered was invalid.
km: កំហុស៖ តម្លៃដែលអ្នកបានបញ្ចូលមិនត្រឹមត្រូវទេ។

source: Error: {e.message}
km: កំហុស៖ {e.message}

source: Error: The two entered values do not match.
km: កំហុស៖ តម្លៃដែលបានបញ្ចូលទាំងពីរមិនត្រូវគ្នាទេ។

source: Error: invalid input
km: កំហុស៖ ការបញ្ចូលមិនត្រឹមត្រូវ

source: Press any key to continue...
km: ចុចគ្រាប់ចុចណាមួយដើម្បីបន្ត...

source: Choose from: {choices}
km: ជ្រើស​ពី:

source: {value!r} is not {choice}.
km: {value!r} មិនមែនជា {choice}

source: {value!r} does not match the format {format}.
km: {value!r} មិនត្រូវគ្នានឹងទម្រង់ {format}

source: {value!r} is not a valid {number_type}.
km: {value!r} មិនមែនជា {number_type} ត្រឹមត្រូវ។

source: {value} is not in the range {range}.
km: {value} មិន​ស្ថិត​នៅ​ក្នុង​ជួរ {range} ទេ

source: {value!r} is not a valid boolean.
km: {value!r} មិនមែនជាប៊ូលីនត្រឹមត្រូវទេ។

source: {value!r} is not a valid UUID.
km: {value!r} មិនមែនជា UUID ត្រឹមត្រូវ។

source: file
km: ឯកសារ

source: directory
km: ថត

source: path
km: ផ្លូវ

source: {name} {filename!r} does not exist.
km: {name} {filename!r} មិនមានទេ។

source: {name} {filename!r} is a file.
km: {name} {filename!r} គឺជាឯកសារ។

source: {name} '{filename}' is a directory.
km: {name} '{filename}' គឺជាថតមួយ។

source: {name} {filename!r} is not readable.
km: {name} {filename!r} មិនអាចអានបានទេ។

source: {name} {filename!r} is not writable.
km: {name} {filename!r} មិនអាចសរសេរបានទេ។

source: {name} {filename!r} is not executable.
km: {name} {filename!r} មិនអាចប្រតិបត្តិបានទេ។

source: {len_type} values are required, but {len_value} was given.
km: តម្លៃ {len_type} ត្រូវបានទាមទារ ប៉ុន្តែ {len_value} ត្រូវបានផ្តល់ឱ្យ។

source: This field is required.
km: ចន្លោះ​នេះ​ត្រូវតែ​បំពេញ។

source: i18n text
km: អត្ថបទ i18n

source: i18n legend
km: រឿងព្រេងនិទាន i18n

source: Enter a valid value.
km: បញ្ចូលតម្លៃត្រឹមត្រូវ។

source: Messages
km: សារ

source: Site Maps
km: ផែនទីគេហទំព័រ

source: Static Files
km: ឯកសារឋិតិវន្ត

source: Syndication
km: ការរួមបញ្ចូល

source: That page number is not an integer
km: លេខទំព័រនោះមិនមែនជាចំនួនគត់ទេ។

source: That page number is less than 1
km: លេខទំព័រនោះតិចជាង 1

source: That page contains no results
km: ទំព័រនោះមិនមានលទ្ធផលទេ។

source: Enter a valid URL.
km: បញ្ចូល URL ត្រឹមត្រូវ។

source: Enter a valid integer.
km: បញ្ចូលចំនួនគត់ត្រឹមត្រូវ។

source: Enter a valid email address.
km: បញ្ចូលអាសយដ្ឋានអ៊ីមែលត្រឹមត្រូវ។

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
km: បញ្ចូល "slug" ត្រឹមត្រូវដែលមានអក្សរ លេខ សញ្ញាគូស ឬសញ្ញាសម្គាល់។

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
km: បញ្ចូល "slug" ត្រឹមត្រូវដែលមានអក្សរយូនីកូដ លេខ គូសក្រោម ឬសហសញ្ញា។

source: Enter a valid IPv4 address.
km: បញ្ចូលអាសយដ្ឋាន IPv4 ត្រឹមត្រូវ។

source: Enter a valid IPv6 address.
km: បញ្ចូលអាសយដ្ឋាន IPv6 ត្រឹមត្រូវ។

source: Enter a valid IPv4 or IPv6 address.
km: បញ្ចូលអាសយដ្ឋាន IPv4 ឬ IPv6 ត្រឹមត្រូវ។

source: Enter only digits separated by commas.
km: បញ្ចូលតែលេខដែលបំបែកដោយសញ្ញាក្បៀស។

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
km: ត្រូវប្រាកដថាតម្លៃនេះគឺ %(limit_value)s (វាគឺ %(show_value)s)។

source: Ensure this value is less than or equal to %(limit_value)s.
km: ត្រូវប្រាកដថាតម្លៃនេះតិចជាង ឬស្មើនឹង %(limit_value)s។

source: Ensure this value is greater than or equal to %(limit_value)s.
km: ត្រូវប្រាកដថាតម្លៃនេះធំជាង ឬស្មើនឹង %(limit_value)s

source: Ensure this value is a multiple of step size %(limit_value)s.
km: ត្រូវប្រាកដថាតម្លៃនេះតិចជាង ឬស្មើនឹង %(limit_value)s។

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
km: ត្រូវប្រាកដថាតម្លៃនេះមានយ៉ាងហោចណាស់ %(limit_value)d តួអក្សរ (វាមាន %(show_value)d)។

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
km: ត្រូវប្រាកដថាតម្លៃនេះមានតួអក្សរ %(limit_value)d ច្រើនបំផុត (វាមាន %(show_value)d)។

source: Enter a number.
km: បញ្ចូលលេខ។

source: Ensure that there are no more than %(max)s digit in total.
km: ត្រូវប្រាកដថាមានខ្ទង់សរុបមិនលើសពី %(អតិបរមា)

source: Ensure that there are no more than %(max)s decimal place.
km: ត្រូវប្រាកដថាមិនមានខ្ទង់ទសភាគលើសពី %(អតិបរមា)

source: Ensure that there are no more than %(max)s digit before the decimal point.
km: ត្រូវប្រាកដថាមានខ្ទង់ %(អតិបរមា)s មុនខ្ទង់ទសភាគ។

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
km: ផ្នែកបន្ថែមឯកសារ “%(extension)s” មិនត្រូវបានអនុញ្ញាតទេ។ ផ្នែកបន្ថែមដែលបានអនុញ្ញាតគឺ៖ %(allowed_extensions)s ។

source: Null characters are not allowed.
km: តួអក្សរទទេមិនត្រូវបានអនុញ្ញាតទេ។

source: and
km: និង

source: %(model_name)s with this %(field_labels)s already exists.
km: %(model_name)s ជាមួយ %(field_labels)s នេះមានរួចហើយ។

source: Value %(value)r is not a valid choice.
km: តម្លៃ %(value)r មិនមែនជាជម្រើសត្រឹមត្រូវទេ។

source: This field cannot be null.
km: វាលនេះមិនអាចចាត់ទុកជាមោឃៈទេ។

source: This field cannot be blank.
km: វាលនេះមិនអាចទទេបានទេ។

source: %(model_name)s with this %(field_label)s already exists.
km: %(model_name)s ជាមួយ %(field_label)s នេះមានរួចហើយ។

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
km: %(field_label)s ត្រូវតែមានតែមួយគត់សម្រាប់ %(date_field_label)s %(lookup_type)s ។

source: Field of type: %(field_type)s
km: វាលនៃប្រភេទ៖ %(field_type)s

source: “%(value)s” value must be either True or False.
km: តម្លៃ “%(value)s” ត្រូវតែពិត ឬមិនពិត។

source: “%(value)s” value must be either True, False, or None.
km: តម្លៃ “%(value)s” ត្រូវតែពិត មិនពិត ឬគ្មាន

source: Boolean (Either True or False)
km: ប៊ូលីន (ពិត ឬមិនពិត)

source: String (up to %(max_length)s)
km: ខ្សែអក្សរ (រហូតដល់ %(max_length)s)

source: Comma-separated integers
km: ចំនួនគត់ដែលបំបែកដោយសញ្ញាក្បៀស
