Repository: kuth-chi/loanproject
Catalog: loansystems/locale/*/LC_MESSAGES/django.po
Languages: km

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
km: តម្លៃ “%(value)s” មានទម្រង់កាលបរិច្ឆេទមិនត្រឹមត្រូវ។ វាត្រូវតែជាទម្រង់ YYYY-MM-DD ។

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
km: តម្លៃ “%(value)s” មានទម្រង់ត្រឹមត្រូវ (YYYY-MM-DD) ប៉ុន្តែវាជាកាលបរិច្ឆេទមិនត្រឹមត្រូវ។

source: Date (without time)
km: កាលបរិច្ឆេទ (ដោយគ្មានពេលវេលា)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
km: តម្លៃ “%(value)s” មានទម្រង់មិនត្រឹមត្រូវ។ វាត្រូវតែជាទម្រង់ YYYY-MM-DD HH:MM[:ss[.uuuuu]][TZ]។

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
km: តម្លៃ “%(value)s” មានទម្រង់ត្រឹមត្រូវ (YYYY-MM-DD HH:MM[:ss[.uuuuu]][TZ]) ប៉ុន្តែវាជាកាលបរិច្ឆេទ/ពេលវេលាមិនត្រឹមត្រូវ។

source: Date (with time)
km: កាលបរិច្ឆេទ (ជាមួយពេលវេលា)

source: “%(value)s” value must be a decimal number.
km: តម្លៃ “%(value)s” ត្រូវតែជាលេខទសភាគ។

source: Decimal number
km: លេខទសភាគ

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
km: តម្លៃ “%(value)s” មានទម្រង់មិនត្រឹមត្រូវ។ វាត្រូវតែជាទម្រង់ [DD] [[HH:]MM:]ss[.uuuuu]។

source: Duration
km: រយៈពេល

source: Email address
km: អាស័យ​ដ្ឋាន​អ៊ី​ម៉េ​ល

source: File path
km: ផ្លូវឯកសារ

source: “%(value)s” value must be a float.
km: តម្លៃ “%(value)s” ត្រូវតែជាលេខ។

source: Floating point number
km: លេខ

source: “%(value)s” value must be an integer.
km: តម្លៃ “%(value)s” ត្រូវតែជាចំនួនគត់។

source: Integer
km: ចំនួនគត់

source: Big (8 byte) integer
km: ចំនួនគត់ធំ (8 បៃ)

source: Small integer
km: ចំនួនគត់តូច

source: IPv4 address
km: អាសយដ្ឋាន IPv4

source: IP address
km: អាសយដ្ឋាន IP

source: “%(value)s” value must be either None, True or False.
km: តម្លៃ “%(value)s” ត្រូវតែជា None, True ឬ False។

source: Boolean (Either True, False or None)
km: ប៊ូលីន (ពិត មិនពិត ឬគ្មាន)

source: Positive big integer
km: ចំនួនគត់វិជ្ជមាន

source: Positive integer
km: ចំនួនគត់វិជ្ជមាន

source: Positive small integer
km: ចំនួនគត់តូចវិជ្ជមាន

source: Slug (up to %(max_length)s)
km: Slug (រហូតដល់ %(max_length)s)

source: Text
km: អត្ថបទ

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
km: តម្លៃ “%(value)s” មានទម្រង់មិនត្រឹមត្រូវ។ វាត្រូវតែជាទម្រង់ HH:MM[:ss[.uuuuu]] ។

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
km: តម្លៃ “%(value)s” មានទម្រង់ត្រឹមត្រូវ (HH:MM[:ss[.uuuuu]]) ប៉ុន្តែវាជាពេលវេលាមិនត្រឹមត្រូវ។

source: Time
km: ពេលវេលា

source: Raw binary data
km: ទិន្នន័យគោលពីរឆៅ

source: “%(value)s” is not a valid UUID.
km: “%(value)s” មិនមែនជា UUID ត្រឹមត្រូវទេ។

source: Universally unique identifier
km: ឧបករណ៍កំណត់អត្តសញ្ញាណតែមួយគត់ជាសកល

source: File
km: ឯកសារ

source: A JSON object
km: វត្ថុ JSON

source: Value must be valid JSON.
km: តម្លៃត្រូវតែជា JSON ត្រឹមត្រូវ។

source: %(model)s instance with %(field)s %(value)r does not exist.
km: %(model)s instance with %(field)s %(value)r មិនមានទេ។

source: Foreign Key (type determined by related field)
km: Foreign Key (ប្រភេទកំណត់ដោយផ្នែកដែលពាក់ព័ន្ធ)

source: One-to-one relationship
km: ទំនាក់ទំនងមួយទៅមួយ។

source: %(from)s-%(to)s relationship
km: ទំនាក់ទំនង %(ពី)s-%(ទៅ)s

source: %(from)s-%(to)s relationships
km: ទំនាក់ទំនង %(ពី)s-%(ទៅ)s

source: Many-to-many relationship
km: ទំនាក់ទំនងច្រើនទៅច្រើន។

source: Enter a whole number.
km: បញ្ចូលលេខទាំងមូល។

source: Enter a valid date.
km: បញ្ចូលកាលបរិច្ឆេទត្រឹមត្រូវ។

source: Enter a valid time.
km: បញ្ចូលពេលវេលាត្រឹមត្រូវ។

source: Enter a valid date/time.
km: បញ្ចូលកាលបរិច្ឆេទ/ពេលវេលាត្រឹមត្រូវ។

source: Enter a valid duration.
km: បញ្ចូលរយៈពេលត្រឹមត្រូវ។

source: The number of days must be between {min_days} and {max_days}.
km: ចំនួនថ្ងៃត្រូវតែនៅចន្លោះ {min_days} និង {max_days}។

source: No file was submitted. Check the encoding type on the form.
km: មិនមានឯកសារត្រូវបានដាក់ស្នើទេ។ ពិនិត្យប្រភេទការអ៊ិនកូដនៅលើចន្លោះ។

source: No file was submitted.
km: មិនមានឯកសារត្រូវបានដាក់ស្នើទេ។

source: The submitted file is empty.
km: ឯកសារដែលបានដាក់គឺទទេ។

source: Ensure this filename has at most %(max)d character (it has %(length)d).
km: ត្រូវប្រាកដថាឈ្មោះឯកសារនេះមានតួអក្សរ %(អតិបរមា)d ច្រើនបំផុត (វាមាន %(ប្រវែង)d)

source: Please either submit a file or check the clear checkbox, not both.
km: សូមដាក់ឯកសារ ឬពិនិត្យប្រអប់ធីកច្បាស់លាស់ មិនមែនទាំងពីរទេ។

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
km: បង្ហោះរូបភាពត្រឹមត្រូវ។ ឯកសារដែលអ្នកបានបង្ហោះមិនមែនជារូបភាព ឬរូបភាពដែលខូចនោះទេ។

source: Select a valid choice. %(value)s is not one of the available choices.
km: ជ្រើសរើសជម្រើសត្រឹមត្រូវ។ %(value)s មិនមែនជាជម្រើសមួយក្នុងចំណោមជម្រើសដែលមានទេ។

source: Enter a list of values.
km: បញ្ចូលបញ្ជីតម្លៃ។

source: Enter a complete value.
km: បញ្ចូលតម្លៃពេញលេញ

source: Enter a valid UUID.
km: បញ្ចូល UUID ត្រឹមត្រូវ។

source: Enter a valid JSON.
km: បញ្ចូល JSON ត្រឹមត្រូវ។

source: (Hidden field %(name)s) %(error)s
km: (វាលដែលលាក់ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
km: ទិន្នន័យ ManagementForm បាត់ ឬត្រូវបានរំខាន។ បាត់វាល៖ %(field_names)s. អ្នកប្រហែលជាត្រូវដាក់របាយការណ៍អំពីបញ្ហា ប្រសិនបើបញ្ហានៅតែបន្តកើតមាន។

source: Please submit at most %(num)d form.
km: សូមដាក់ទម្រង់ %d ច្រើនបំផុត។

source: Please submit at least %(num)d form.
km: សូមដាក់ទម្រង់យ៉ាងតិច %d ។

source: Order
km: បញ្ជាទិញ

source: Please correct the duplicate data for %(field)s.
km: សូមកែតម្រូវទិន្នន័យស្ទួនសម្រាប់ %(field)s ។

source: Please correct the duplicate data for %(field)s, which must be unique.
km: សូមកែតម្រូវទិន្នន័យស្ទួនសម្រាប់ %(field)s ដែលត្រូវតែមានតែមួយគត់។

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
km: សូមកែតម្រូវទិន្នន័យស្ទួនសម្រាប់ %(field_name)s ដែលត្រូវតែមានតែមួយគត់សម្រាប់ %(lookup)s ក្នុង %(date_field)s ។

source: Please correct the duplicate values below.
km: សូមកែតម្រូវតម្លៃស្ទួនខាងក្រោម។

source: The inline value did not match the parent instance.
km: តម្លៃក្នុងជួរមិនត្រូវគ្នានឹងឧទាហរណ៍មេទេ។

source: Select a valid choice. That choice is not one of the available choices.
km: ជ្រើសរើសជម្រើសត្រឹមត្រូវ។ ជម្រើសនោះមិនមែនជាជម្រើសដែលមានទេ។

source: “%(pk)s” is not a valid value.
km: “%(pk)s” មិនមែនជាតម្លៃត្រឹមត្រូវទេ។

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
km: %(datetime)s មិនអាចបកស្រាយនៅក្នុងតំបន់ពេលវេលា %(current_timezone)s បានទេ។ វាអាចមានភាពមិនច្បាស់លាស់ ឬវាប្រហែលជាមិនមាន។

source: Clear
km: ច្បាស់

source: Currently
km: ឥលូវនេះ

source: Change
km: ប្តូរ

source: Unknown
km: មិនស្គាល់

source: Yes
km: បាទ

source: No
km: ទេ

source: yes,no,maybe
km: មែន ទេ​ ប្រហែល

source: %(size)d byte
km: %(ទំហំ)d បៃ

source: p.m.
km: ល្ងាច

source: a.m.
km: ព្រឹក

source: PM
km: ពេលល្ងាច

source: AM
km: ពេលព្រឹក

source: midnight
km: កណ្តាលអាទ្រៀត

source: noon
km: រសៀល

source: Monday
km: ថ្ងៃច័ន្ទ

source: Tuesday
km: ថ្ងៃអង្គារ

source: Wednesday
km: ថ្ងៃពុធ

source: Thursday
km: ថ្ងៃព្រហស្បតិ៍

source: Friday
km: ថ្ងៃសុក្រ

source: Saturday
km: ថ្ងៃសៅរ៍

source: Sunday
km: ថ្ងៃអាទិត្យ

source: Mon
km: ច័ន្ទ

source: Tue
km: អង្គារ៍

source: Wed
km: ពុធ

source: Thu
km: ព្រហស្បតិ៍

source: Fri
km: សុក្រ

source: Sat
km: សៅរ៍

source: Sun
km: អាទិត្យ

source: January
km: ខែមករា

source: February
km: កុម្ភៈ

source: March
km: មីនា

source: April
km: ​មេសា

source: June
km: មិថុនា

source: July
km: កក្កដា

source: August
km: សីហា

source: September
km: កញ្ញា

source: October
km: តុលា

source: November
km: \វិច្ឆិកា

source: December
km: ធ្នូ

source: jan
km: កមរា

source: feb
km: កុម្ភៈ

source: mar
km: មីនា

source: apr
km: មេសា

source: may
km: ឧសភា

source: jun
km: មិថុនា

source: jul
km: កក្តា

source: aug
km: សីហា

source: sep
km: កញ្ញា

source: oct
km: តុលា

source: nov
km: វិច្ឆិកា

source: dec
km: ធ្នូ

# abbrev. month
source: Jan.
km: មករា

# abbrev. month
source: Feb.
km: កុម្ភៈ

# abbrev. month
source: March
km: មីនា

# abbrev. month
source: April
km: ​មេសា

# abbrev. month
source: May
km: ឧសភា

# abbrev. month
source: June
km: មិថុនា

# abbrev. month
source: July
km: កក្តដា

# abbrev. month
source: Aug.
km: សីហា

# abbrev. month
source: Sept.
km: កញ្ញា

# abbrev. month
source: Oct.
km: តុលា

# abbrev. month
source: Nov.
km: វិច្ឆិកា

# abbrev. month
source: Dec.
km: ធ្នូ

# alt. month
source: January
km: ខែមករា

# alt. month
source: February
km: កុម្ភៈ

# alt. month
source: March
km: មីនា

# alt. month
source: April
km: មេសា

# alt. month
source: May
km: ឧសភា

# alt. month
source: June
km: មិថុនា

# alt. month
source: July
km: កក្តដា

# alt. month
source: August
km: សីហា

# alt. month
source: September
km: កញ្ញា

# alt. month
source: October
km: តុលា

# alt. month
source: November
km: វិច្ឆិកា

# alt. month
source: December
km: ធ្នូ

source: This is not a valid IPv6 address.
km: នេះមិនមែនជាអាសយដ្ឋាន IPv6 ត្រឹមត្រូវទេ។

source: or
km: ឬ

source: %(num)d year
km: ឆ្នាំ

source: %(num)d month
km: ខែ

source: %(num)d week
km: សប្តាហ៍

source: %(num)d day
km: ថ្ងៃ

source: %(num)d hour
km: ម៉ោង

source: %(num)d minute
km: នាទី

source: Forbidden
km: ហាម

source: CSRF verification failed. Request aborted.
km: ការផ្ទៀងផ្ទាត់ CSRF បានបរាជ័យ។ សំណើត្រូវបានលុបចោល។

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
km: អ្នកកំពុងឃើញសារនេះ ដោយសារគេហទំព័រ HTTPS នេះទាមទារ "បឋមកថាយោង" ដើម្បីផ្ញើដោយកម្មវិធីរុករកតាមអ៊ីនធឺណិតរបស់អ្នក ប៉ុន្តែគ្មានការផ្ញើទេ។ បឋមកថានេះត្រូវបានទាមទារសម្រាប់ហេតុផលសុវត្ថិភាព ដើម្បីធានាថាកម្មវិធីរុករករបស់អ្នកមិនត្រូវបានប្លន់ដោយភាគីទីបី។

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
km: ប្រសិនបើអ្នកបានកំណត់រចនាសម្ព័ន្ធកម្មវិធីរុករករបស់អ្នកដើម្បីបិទបឋមកថា "អ្នកយោង" សូមបើកពួកវាឡើងវិញ យ៉ាងហោចណាស់សម្រាប់គេហទំព័រនេះ ឬសម្រាប់ការតភ្ជាប់ HTTPS ឬសម្រាប់សំណើ "ប្រភពដើមដូចគ្នា" ។

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
km: ប្រសិនបើអ្នកកំពុងប្រើស្លាក <meta name="referrer" content="no-referrer"> ឬរួមបញ្ចូលបឋមកថា “Referrer-Policy: no-referrer” សូមលុបពួកវាចេញ។ ការការពារ CSRF ទាមទារបឋមកថា "អ្នកយោង" ដើម្បីធ្វើការត្រួតពិនិត្យយ៉ាងតឹងរ៉ឹង។ ប្រសិនបើអ្នកព្រួយបារម្ភអំពីឯកជនភាព សូមប្រើជម្រើសផ្សេងទៀតដូចជា <a rel="noreferrer" …> សម្រាប់តំណភ្ជាប់ទៅកាន់គេហទំព័រភាគីទីបី។

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
km: អ្នកកំពុងឃើញសារនេះ ដោយសារគេហទំព័រនេះទាមទារខូគី CSRF នៅពេលដាក់ស្នើទម្រង់។ ខូគីនេះត្រូវបានទាមទារសម្រាប់ហេតុផលសុវត្ថិភាព ដើម្បីធានាថាកម្មវិធីរុករករបស់អ្នកមិនត្រូវបានប្លន់ដោយភាគីទីបី។

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
km: ប្រសិនបើអ្នកបានកំណត់រចនាសម្ព័ន្ធកម្មវិធីរុករករបស់អ្នកដើម្បីបិទខូឃី សូមបើកពួកវាឡើងវិញ យ៉ាងហោចណាស់សម្រាប់គេហទំព័រនេះ ឬសម្រាប់សំណើ "ប្រភពដើមដូចគ្នា"។

source: More information is available with DEBUG=True.
km: ព័ត៌មានបន្ថែមមានជាមួយ DEBUG=True។

source: No year specified
km: មិនបានបញ្ជាក់ឆ្នាំទេ។

source: Date out of range
km: កាល​បរិច្ឆេទ​នៅ​ក្រៅ​ជួរ

source: No month specified
km: មិនបានបញ្ជាក់ខែទេ។

source: No day specified
km: គ្មានថ្ងៃជាក់លាក់

source: No week specified
km: គ្មានខែជាក់លាក់

source: No %(verbose_name_plural)s available
km: មិនមាន %(verbose_name_plural)s ទេ។

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
km: Future %(verbose_name_plural)s មិនអាចប្រើបានទេ ដោយសារ %(class_name)s.allow_future មិនពិត។

source: Invalid date string “%(datestr)s” given format “%(format)s”
km: ខ្សែអក្សរកាលបរិច្ឆេទមិនត្រឹមត្រូវ “%(datestr)s” ដែលផ្តល់ទម្រង់ “%(format)s”

source: No %(verbose_name)s found matching the query
km: រកមិនឃើញ %(verbose_name) ដែលត្រូវគ្នានឹងសំណួរនោះទេ។

source: Page is not “last”, nor can it be converted to an int.
km: ទំព័រមិនមែនជា "ចុងក្រោយ" ហើយក៏មិនអាចបំប្លែងទៅជា int បានទេ។

source: Invalid page (%(page_number)s): %(message)s
km: ទំព័រមិនត្រឹមត្រូវ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
km: បញ្ជីទទេ និង “%(class_name)s.allow_empty” គឺមិនពិត។

source: Directory indexes are not allowed here.
km: លិបិក្រមថតមិនត្រូវបានអនុញ្ញាតនៅទីនេះទេ។

source: “%(path)s” does not exist
km: "%(path)s" មិនមានទេ។

source: Index of %(directory)s
km: សន្ទស្សន៍ %(ថត)s

source: The install worked successfully! Congratulations!
km: ការដំឡើងដំណើរការដោយជោគជ័យ! អបអរសាទរ!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
km: មើល <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">កំណត់ចំណាំការចេញផ្សាយ</a> សម្រាប់ Django %(កំណែ) ស

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
km: អ្នកកំពុងឃើញទំព័រនេះ ដោយសារ <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True </a> គឺនៅក្នុងឯកសារការកំណត់របស់អ្នក ហើយអ្នកមិនបានកំណត់រចនាសម្ព័ន្ធ URL ណាមួយទេ។

source: Django Documentation
km: ឯកសារ Django

source: Topics, references, &amp; how-to’s
km: ប្រធានបទ ឯកសារយោង &amp; របៀបធ្វើ

source: Tutorial: A Polling App
km: ការបង្រៀន៖ កម្មវិធីបោះឆ្នោត

source: Get started with Django
km: ចាប់ផ្តើមជាមួយ Django

source: Django Community
km: សហគមន៍ Django

source: Connect, get help, or contribute
km: ភ្ជាប់ ទទួលជំនួយ ឬរួមចំណែក
